# Week 2's assignment

**Practice Questions for Pandas**
1. From df filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

In [131]:
import pandas as pd
import numpy as np

In [132]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

2. Replace missing values in Min.Price and Max.Price columns with their respective mean.

In [133]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

3. How to get the rows of a dataframe with row sum > 100?

In [134]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))

---

**Question 1**

1. From df filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

In [135]:
import pandas as pd
import numpy as np

In [136]:
df_question1 = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [137]:
df_filtered_question1 = df_question1[["Manufacturer", "Model", "Type"]]
df_filtered_question1

   Manufacturer    Model     Type
0         Acura  Integra    Small
1           NaN   Legend  Midsize
2          Audi       90  Compact
3          Audi      100  Midsize
4           BMW     535i  Midsize
..          ...      ...      ...
88   Volkswagen  Eurovan      Van
89   Volkswagen   Passat  Compact
90   Volkswagen  Corrado   Sporty
91        Volvo      240  Compact
92          NaN      850  Midsize

[93 rows x 3 columns]

In [138]:
df_filtered_question1.shape

(93, 3)

In [139]:
df_filtered_question1[::20] # display every 20 element

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [140]:
# final solution 
# 1. From df filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).
df_question1 = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df_question1_filtered = df_question1[["Manufacturer", "Model", "Type"]][::20]
df_question1_filtered

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

**Question 2**

Replace missing values in Min.Price and Max.Price columns with their respective mean.

In [141]:
df_question2 = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [142]:
df_question2.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,NaN,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [143]:
df_question2[["Min.Price", "Max.Price"]]

    Min.Price  Max.Price
0        12.9       18.8
1        29.2       38.7
2        25.9       32.3
3         NaN       44.6
4         NaN        NaN
..        ...        ...
88       16.6       22.7
89       17.6       22.4
90       22.9       23.7
91       21.8       23.5
92       24.8       28.5

[93 rows x 2 columns]

In [144]:
min_price_column_mean = df_question2["Min.Price"].mean()
max_price_column_mean = df_question2["Max.Price"].mean()

print(f"mean of min_price column: {min_price_column_mean}")
print(f"mean of max_price column: {max_price_column_mean}")

mean of min_price column: 17.118604651162787
mean of max_price column: 21.45909090909091

In [145]:
df_question2["Min.Price"][3]

nan

In [146]:
print(df_question2["Min.Price"][3])       # nan
print(df_question2["Min.Price"][3].dtype) # dtype('float64')

nan
float64

In [147]:
df_question2["Min.Price"][df_question2["Min.Price"] > 35]

10    37.5
47    45.4
58    43.8
Name: Min.Price, dtype: float64

In [148]:
df_question2["Min.Price"][df_question2["Min.Price"].isna()]

3    NaN
4    NaN
25   NaN
29   NaN
72   NaN
83   NaN
86   NaN
Name: Min.Price, dtype: float64

In [149]:
df_question2.loc[df_question2["Min.Price"].isna(), "Min.Price"] = min_price_column_mean
#df_question2["Min.Price"][df_question2["Min.Price"].isna()][:] = min_price_column_mean

In [150]:
df_question2["Min.Price"][df_question2["Min.Price"].isna()]

Series([], Name: Min.Price, dtype: float64)

In [151]:
df_question2["Min.Price"].describe()

count    93.000000
mean     17.118605
std       8.485787
min       6.700000
25%      11.400000
50%      14.900000
75%      19.900000
max      45.400000
Name: Min.Price, dtype: float64

In [152]:
df_question2["Max.Price"][df_question2["Max.Price"].isna()]

4    NaN
6    NaN
47   NaN
62   NaN
82   NaN
Name: Max.Price, dtype: float64

In [153]:
# loc is label-based. You specify row labels and column names exactly as they appear in the DataFrame.
# df.loc[row_labels, column_labels]
df_question2.loc[df_question2["Max.Price"].isna(), "Max.Price"] = max_price_column_mean

In [154]:
df_question2["Max.Price"][df_question2["Max.Price"].isna()]

Series([], Name: Max.Price, dtype: float64)

In [155]:
df_question2["Max.Price"].describe()

count    93.000000
mean     21.459091
std      10.401836
min       7.900000
25%      14.900000
50%      21.000000
75%      24.400000
max      80.000000
Name: Max.Price, dtype: float64

In [156]:
df_question2[["Min.Price", "Max.Price"]].describe()

       Min.Price  Max.Price
count  93.000000  93.000000
mean   17.118605  21.459091
std     8.485787  10.401836
min     6.700000   7.900000
25%    11.400000  14.900000
50%    14.900000  21.000000
75%    19.900000  24.400000
max    45.400000  80.000000

In [157]:
df_question2[["Min.Price", "Max.Price"]].isna().value_counts()

Min.Price  Max.Price
False      False        93
Name: count, dtype: int64

In [158]:
# final solution
# Replace missing values in Min.Price and Max.Price columns with their respective mean.
df_question2 = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

min_price_mean = df_question2["Min.Price"].mean()
df_question2.loc[df_question2["Min.Price"].isna(), "Min.Price"] = min_price_mean

max_price_mean = df_question1["Max.Price"].mean()
df_question2.loc[df_question2["Max.Price"].isna(), "Max.Price"] = max_price_mean

df_question2[["Min.Price", "Max.Price"]].describe()

       Min.Price  Max.Price
count  93.000000  93.000000
mean   17.118605  21.459091
std     8.485787  10.401836
min     6.700000   7.900000
25%    11.400000  14.900000
50%    14.900000  21.000000
75%    19.900000  24.400000
max    45.400000  80.000000

**Question 3**

How to get the rows of a dataframe with row sum > 100?

In [280]:
df_question3 = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))

In [262]:
np.random.randint(10, 40, 60).shape

(60,)

In [281]:
df_question3.head()

    0   1   2   3
0  27  13  36  13
1  39  27  22  18
2  35  23  19  28
3  16  27  30  25
4  30  19  22  13

In [282]:
df_question3.shape

(15, 4)

In [283]:
df_question3.iloc[0,3]

13

In [284]:
df_question3["row_sum"] = df_question3.sum(axis = 1)

In [285]:
df_question3.head()

    0   1   2   3  row_sum
0  27  13  36  13       89
1  39  27  22  18      106
2  35  23  19  28      105
3  16  27  30  25       98
4  30  19  22  13       84

In [286]:
df_question3[df_question3["row_sum"] > 100]

     0   1   2   3  row_sum
1   39  27  22  18      106
2   35  23  19  28      105
5   26  24  31  29      110
6   26  27  27  30      110
8   22  32  17  36      107
11  21  19  37  26      103
12  32  39  27  11      109
13  36  30  34  33      133

In [290]:
# final solution
df_question3 = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df_question3["row_sum"] = df_question3.sum(axis = 1)
df_question3[df_question3["row_sum"] > 100]

     0   1   2   3  row_sum
1   37  22  32  34      125
3   28  33  21  19      101
5   37  20  14  35      106
8   36  30  23  30      119
9   37  28  10  37      112
13  39  36  27  11      113